# TemperatureRatingTypeSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingTypeSet Constructor
TemperatureRatingTypeSet Class See Also
---
Initializes a new instance of the TemperatureRatingTypeSet class
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TemperatureRatingTypeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
TemperatureRatingTypeSet()
```

# See Also
TemperatureRatingTypeSet Class
Autodesk.Revit.DB.Electrical Namespace